---
kind: property
id: P:Autodesk.Revit.DB.SymbolicCurve.ReferenceType
source: html/1970ed10-04a1-566a-f360-e169de98b156.htm
---
# Autodesk.Revit.DB.SymbolicCurve.ReferenceType Property

Indicates the type of reference.

## Syntax (C#)
```csharp
public ReferenceType ReferenceType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when argument is out of range.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when regeneration failed.